clear;
clc;

hold on;
%无Cu滴定曲线
v1=[0.00 	2.00 	4.00 	6.00 	7.00 	8.00 	8.50 	8.54 	8.60 	8.65 	8.68 	8.74 	8.80 	8.85 	8.90 	8.93 	9.00 	9.51 	9.99 	11.00 	12.00 ];
pH1=[1.95 	2.12 	2.35 	2.70 	2.97 	3.46 	4.44 	4.94 	5.99 	7.10 	8.87 	9.64 	9.84 	10.01 	10.13 	10.23 	10.34 	10.85 	11.06 	11.34 	11.51 ];
scatter(v1,pH1,500,'x','LineWidth',3);%数据散点图
values1 = spcrv([[v1(1) v1 v1(end)];[pH1(1) pH1 pH1(end)]],3);%为画平滑曲线进行插值（增加数据间推算的点）
plot(values1(1,:),values1(2,:),'-.','LineWidth',3);%画平滑曲线
%有Cu滴定曲线
v2=[0.00 	2.00 	4.00 	6.00 	7.00 	8.00 	8.50 	8.88 	8.97 	9.30 	9.50 	9.55 	9.60 	9.65 	9.75 	9.90 	10.11 	10.35 	10.50 	10.54 	10.60 	10.63 	10.68 	10.70 	10.75 	10.81 	10.85 	11.00 	11.24 	11.50 	12.00 	13.00 ];
pH2=[1.95 	2.12 	2.35 	2.68 	2.93 	3.34 	3.71 	4.18 	4.31 	4.85 	5.52 	5.89 	6.09 	6.27 	6.64 	6.94 	7.30 	7.92 	8.65 	9.00 	9.39 	9.64 	9.83 	9.98 	10.13 	10.26 	10.36 	10.55 	10.80 	10.95 	11.16 	11.42 ];
scatter(v2,pH2,500,'+','LineWidth',3);%数据散点图
values2 = spcrv([[v2(1) v2 v2(end)];[pH2(1) pH2 pH2(end)]],3);%为画平滑曲线进行插值（增加数据间推算的点）
plot(values2(1,:),values2(2,:),'LineWidth',3);%画平滑曲线
%求拐点
dy1=gradient(pH1)./gradient(v1);%对无Cu的散点数据使用梯度法求近似一阶导数
plot(v1,dy1,':','LineWidth',3);%作出导函数图象
dy2=gradient(pH2)./gradient(v2);%对有Cu的散点数据使用梯度法求近似一阶导数
plot(v2,dy2,'--','LineWidth',3);%作出导函数图象

title('滴定曲线','FontSize',25);
xlabel('V(NaOH)/mL','FontSize',25);
ylabel('pH','FontSize',25);
legend('无Cu数据','无Cu曲线','有Cu数据','有Cu曲线','无Cu曲线一阶导','有Cu曲线一阶导','FontSize',25)

hold off;
